# KeynoteEntry Constructor (String, String, String) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
KeynoteEntry Constructor (String, String, String)
KeynoteEntry Class See Also
---
Constructs a new KeynoteEntry from the given key name, parent key name, and keynote text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public KeynoteEntry(
	string key,
	string parentKey,
	string text
)
```

Visual Basic
---
```text
Public Sub New ( _
	key As String, _
	parentKey As String, _
	text As String _
)
```

Visual C++
---
```text
public:
KeynoteEntry(
	String^ key,
	String^ parentKey,
	String^ text
)
```

# ### Parameters
key
    Type: System..::..String The key of this KeynoteEntry.
parentKey
    Type: System..::..String The parent key of this KeynoteEntry. Empty string means this KeynoteEntry does not have a parent.
text
    Type: System..::..String The text associated with this KeynoteEntry
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | key is an empty string. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
KeynoteEntry Class
KeynoteEntry Overload
Autodesk.Revit.DB Namespace